cmsis-svd/cmsis-svd/data/Freescale/MKE14Z7.svd
        <register>
          <name>FACSN</name>
          <description>Flash Access Segment Number Register</description>
          <addressOffset>0x2B</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>NUMSG</name>
              <description>Number of Segments Indicator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>110000</name>
                  <description>Program flash memory is divided into 48 segments (768 Kbytes, 1.5 Mbytes)</description>
                  <value>#110000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000000</name>
                  <description>Program flash memory is divided into 64 segments (512 Kbytes, 1 Mbyte, 2 Mbytes)</description>
                  <value>#1000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FERSTAT</name>
          <description>Flash Error Status Register</description>
          <addressOffset>0x2E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DFDIF</name>
              <description>Double Bit Fault Detect Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Double bit fault not detected during a valid flash read access from the platform flash controller</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Double bit fault detected (or FERCNFG[FDFD] is set) during a valid flash read access from the platform flash controller</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FERCNFG</name>
          <description>Flash Error Configuration Register</description>
          <addressOffset>0x2F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DFDIE</name>
              <description>Double Bit Fault Detect Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Double bit fault detect interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Double bit fault detect interrupt enabled. An interrupt request is generated whenever the FERSTAT[DFDIF] flag is set.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDFD</name>
              <description>Force Double Bit Fault Detect</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>FERSTAT[DFDIF] sets only if a double bit fault is detected during read access from the platform flash controller</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>FERSTAT[DFDIF] sets during any valid flash read access from the platform flash controller. An interrupt request is generated if the DFDIE bit is set.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMAMUX</name>
      <description>DMA channel multiplexor</description>
      <prependToName>DMAMUX_</prependToName>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>8</dim>
          <dimIncrement>0x1</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
          <name>CHCFG%s</name>
          <description>Channel Configuration register</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SOURCE</name>
              <description>DMA Channel Source (Slot)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable_Signal</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>LPUART0_Rx_Signal</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>LPUART0_Tx_Signal</description>
                  <value>#11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>LPUART1_Rx_Signal</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>LPUART1_Tx_Signal</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>LPUART2_Rx_Signal</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>LPUART2_Tx_Signal</description>
                  <value>#111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>FlexIO_Channel0_Signal</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>FlexIO_Channel1_Signal</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>FlexIO_Channel2_Signal</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>FlexIO_Channel3_Signal</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>LPSPI0_Rx_Signal</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>LPSPI0_Tx_Signal</description>
                  <value>#1111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>LPSPI1_Rx_Signal</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>LPSPI1_Tx_Signal</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>LPI2C0_Rx_Signal</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19</name>
                  <description>LPI2C0_Tx_Signal</description>
                  <value>#10011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>FTM0_Channel0_Signal</description>
                  <value>#10100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>FTM0_Channel1_Signal</description>
                  <value>#10101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>FTM0_Channel2_Signal</description>
                  <value>#10110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23</name>
                  <description>FTM0_Channel3_Signal</description>
                  <value>#10111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>FTM0_Channel4_Signal</description>
                  <value>#11000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>25</name>
                  <description>FTM0_Channel5_Signal</description>
                  <value>#11001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>26</name>
                  <description>FTM0_Channel6_Signal</description>
                  <value>#11010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>27</name>
                  <description>FTM0_Channel7_Signal</description>
                  <value>#11011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>28</name>
                  <description>FTM1_Channel0_Signal</description>
                  <value>#11100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>29</name>
                  <description>FTM1_Channel1_Signal</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>30</name>
                  <description>FTM2_Channel0_Signal</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>31</name>
                  <description>FTM2_Channel1_Signal</description>
                  <value>#11111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>LPI2C1_Rx_Signal</description>
                  <value>#100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>33</name>
                  <description>LPI2C1_Tx_Signal</description>
                  <value>#100001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>40</name>
                  <description>ADC0_Signal</description>
                  <value>#101000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>41</name>
                  <description>ADC1_Signal</description>
                  <value>#101001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>43</name>
                  <description>CMP0_Signal</description>
                  <value>#101011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>44</name>
                  <description>CMP1_Signal</description>
                  <value>#101100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>46</name>
                  <description>PDB0_Signal</description>
                  <value>#101110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>49</name>
                  <description>PortA_Signal</description>
                  <value>#110001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>50</name>
                  <description>PortB_Signal</description>
                  <value>#110010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>51</name>
                  <description>PortC_Signal</description>
                  <value>#110011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>52</name>
                  <description>PortD_Signal</description>
                  <value>#110100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>53</name>
                  <description>PortE_Signal</description>
                  <value>#110101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>57</name>
                  <description>FTM1_Channel2_Signal</description>
                  <value>#111001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>58</name>
                  <description>FTM2_Channel2_Signal</description>
                  <value>#111010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>59</name>
                  <description>LPTMR0_Signal</description>
                  <value>#111011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>60</name>
                  <description>AlwaysOn60_Signal</description>
                  <value>#111100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>61</name>
                  <description>AlwaysOn61_Signal</description>
                  <value>#111101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>62</name>
                  <description>AlwaysOn62_Signal</description>
                  <value>#111110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>63</name>
                  <description>AlwaysOn63_Signal</description>
                  <value>#111111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG</name>
              <description>DMA Channel Trigger Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Triggering is disabled. If triggering is disabled and ENBL is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Triggering is enabled. If triggering is enabled and ENBL is set, the DMAMUX is in Periodic Trigger mode.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENBL</name>
              <description>DMA Channel Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>DMA channel is disabled. This mode is primarily used during configuration of the DMAMux. The DMA has separate channel enables/disables, which should be used to disable or reconfigure a DMA channel.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>DMA channel is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
